In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('daily-total-female-births-CA.csv', header= 0, parse_dates=[0])
# l'argument parse_dates permet d'inddiquer les colonnes à considérer comme étant des dates

In [3]:
df.head()

        date  births
0 1959-01-01      35
1 1959-01-02      32
2 1959-01-03      30
3 1959-01-04      31
4 1959-01-05      44

In [4]:
df['date'].dtype

dtype('<M8[ns]')

**dans le cas où pandas n'arrive à pas trouver le bon format de date**
il faut utiliser le paramètre: ***data_parser=dateparse***

In [6]:
# definir la colonne date comme étant la colonne des indices
df2=pd.read_csv('daily-total-female-births-CA.csv', header= 0, parse_dates=[0], index_col='date', squeeze=True)
# l'argument squeeze permet de transformer df2 to a series

In [7]:
df2.head()

date
1959-01-01    35
1959-01-02    32
1959-01-03    30
1959-01-04    31
1959-01-05    44
Name: births, dtype: int64

In [8]:
df2.shape

(365,)

###### queyring by time
you don't need to respect the fully format of date:that is the advantage

In [9]:
df2['1959-01'] # moi de janvier

date
1959-01-01    35
1959-01-02    32
1959-01-03    30
1959-01-04    31
1959-01-05    44
1959-01-06    29
1959-01-07    45
1959-01-08    43
1959-01-09    38
1959-01-10    27
1959-01-11    38
1959-01-12    33
1959-01-13    55
1959-01-14    47
1959-01-15    45
1959-01-16    37
1959-01-17    50
1959-01-18    43
1959-01-19    41
1959-01-20    52
1959-01-21    34
1959-01-22    53
1959-01-23    39
1959-01-24    32
1959-01-25    37
1959-01-26    43
1959-01-27    39
1959-01-28    35
1959-01-29    44
1959-01-30    38
1959-01-31    24
Name: births, dtype: int64

In [10]:
df2['1959-02-28']

30

In [11]:
df2['1959'] # toute l'année

date
1959-01-01    35
1959-01-02    32
1959-01-03    30
1959-01-04    31
1959-01-05    44
              ..
1959-12-27    37
1959-12-28    52
1959-12-29    48
1959-12-30    55
1959-12-31    50
Name: births, Length: 365, dtype: int64

In [14]:
df[(df['date']>'1959-02-03') & (df['date']<'1959-02-17')]

# la synthaxe est plus simplifiée pour les series que pour les dataframe

         date  births
34 1959-02-04      38
35 1959-02-05      50
36 1959-02-06      38
37 1959-02-07      51
38 1959-02-08      31
39 1959-02-09      31
40 1959-02-10      51
41 1959-02-11      36
42 1959-02-12      45
43 1959-02-13      51
44 1959-02-14      34
45 1959-02-15      52
46 1959-02-16      47

###### Descriptive Statistics

In [15]:
df.describe()

           births
count  365.000000
mean    41.980822
std      7.348257
min     23.000000
25%     37.000000
50%     42.000000
75%     46.000000
max     73.000000

In [16]:
df2.describe()

count    365.000000
mean      41.980822
std        7.348257
min       23.000000
25%       37.000000
50%       42.000000
75%       46.000000
max       73.000000
Name: births, dtype: float64